tests/AvalaraTaxResponseMocked.json

{
   "data": {
      "id": 0,
      "code": "4c964c8d-0725-4946-a9af-7dc4cda29f91",
      "companyId": 7834585,
      "date": "2023-01-17",
      "paymentDate": "2023-01-17",
      "status": "Temporary",
      "type": "SalesOrder",
      "batchCode": "",
      "currencyCode": "USD",
      "exchangeRateCurrencyCode": "USD",
      "customerUsageType": "",
      "entityUseCode": "",
      "customerVendorCode": "ABC",
      "customerCode": "ABC",
      "exemptNo": "",
      "reconciled": false,
      "locationCode": "",
      "reportingLocationCode": "",
      "purchaseOrderNo": "",
      "referenceCode": "",
      "salespersonCode": "",
      "totalAmount": 59.96,
      "totalExempt": 0.0,
      "totalDiscount": 0.0,
      "totalTax": 3.7,
      "totalTaxable": 59.96,
      "totalTaxCalculated": 3.7,
      "adjustmentReason": "NotAdjusted",
      "locked": false,
      "version": 1,
      "exchangeRateEffectiveDate": "2023-01-17",
      "exchangeRate": 1.0,
      "modifiedDate": "2023-01-17T01:48:06.6723274Z",
      "modifiedUserId": 6507193,
      "taxDate": "2023-01-17",
      "lines": [
         {
            "id": 0,
            "transactionId": 0,
            "lineNumber": "1",
            "customerUsageType": "",
            "entityUseCode": "",
            "discountAmount": 0.0,
            "exemptAmount": 0.0,
            "exemptCertId": 0,
            "exemptNo": "",
            "isItemTaxable": true,
            "itemCode": "",
            "lineAmount": 59.96,
            "quantity": 1.0,
            "ref1": "",
            "ref2": "",
            "reportingDate": "2023-01-17",
            "tax": 3.7,
            "taxableAmount": 59.96,
            "taxCalculated": 3.7,
            "taxCode": "P0000000",
            "taxCodeId": 8087,
            "taxDate": "2023-01-17",
            "taxIncluded": false,
            "details": [
               {
                  "id": 0,
                  "transactionLineId": 0,
                  "transactionId": 0,
                  "country": "US",
                  "region": "MA",
                  "exemptAmount": 0.0,
                  "jurisCode": "25",
                  "jurisName": "MASSACHUSETTS",
                  "stateAssignedNo": "",
                  "jurisType": "STA",
                  "jurisdictionType": "State",
                  "nonTaxableAmount": 0.0,
                  "rate": 0.062500,
                  "tax": 3.7,
                  "taxableAmount": 59.96,
                  "taxType": "Sales",
                  "taxSubTypeId": "S",
                  "taxName": "MA STATE TAX",
                  "taxAuthorityTypeId": 45,
                  "taxCalculated": 3.7,
                  "rateType": "General",
                  "rateTypeCode": "G",
                  "unitOfBasis": "PerCurrencyUnit",
                  "isNonPassThru": false,
                  "isFee": false,
                  "reportingTaxableUnits": 59.96,
                  "reportingNonTaxableUnits": 0.0,
                  "reportingExemptUnits": 0.0,
                  "reportingTax": 3.7,
                  "reportingTaxCalculated": 3.7,
                  "liabilityType": "Seller"
               }
            ],
            "nonPassthroughDetails": [],
            "hsCode": "",
            "costInsuranceFreight": 0.0,
            "vatCode": "",
            "vatNumberTypeId": 0
         }
      ],
      "addresses": [
         {
            "id": 0,
            "transactionId": 0,
            "boundaryLevel": "Address",
            "line1": "1 main st",
            "line2": "",
            "line3": "",
            "city": "Cambridge",
            "region": "MA",
            "postalCode": "02142",
            "country": "US",
            "taxRegionId": 4026789,
            "latitude": "42.362013",
            "longitude": "-71.079974"
         }
      ],
      "summary": [
         {
            "country": "US",
            "region": "MA",
            "jurisType": "State",
            "jurisCode": "25",
            "jurisName": "MASSACHUSETTS",
            "taxAuthorityType": 45,
            "stateAssignedNo": "",
            "taxType": "Sales",
            "taxSubType": "S",
            "taxName": "MA STATE TAX",
            "rateType": "General",
            "taxable": 59.96,
            "rate": 0.062500,
            "tax": 3.7,
            "taxCalculated": 3.7,
            "nonTaxable": 0.0,
            "exemption": 0.0
         }
      ]
   }
}